app/Controllers/Admin.php

    public function delete_Hotel($id_hotel)
    {

        $data = $this->hotel->callHotel($id_hotel)->getRow();
        $file = $data->foto_hotel;
        unlink("img/hotel/" . $file);

        $this->hotel->delete(['id_hotel' => $id_hotel]);
---
DELETE FROM `tbl_hotel`
WHERE `id_hotel` IN ('14')