app/Models/ModelSetting.php

SELECT *
FROM `tbl_setting`
WHERE `id` = 1
---
    function tampilData()
    {
        return $this->Where(['id' => 1])->get();