app/Models/ModelGeojson.php

    function callGeojson($id = false)
    {
        if ($id === false) {
            return $this->db->table('tbl_wilayah')->get();
---
SELECT *
FROM `tbl_wilayah`