app/Models/ModelHotel.php

SELECT *
FROM `tbl_jenjang`
ORDER BY `id_jenjang` ASC
---
    public function allJenjang()
    {
        return $this->db->table('tbl_jenjang')->orderBy('id_jenjang', 'ASC')->get()->getResultArray();