app/Models/ModelSekolah.php

    function callSekolah($id_sekolah = false)
    {
        if ($id_sekolah === false) {
            return $this->db->table('tbl_sekolah')->get();
---
SELECT *
FROM `tbl_sekolah`