app/Models/ModelHotel.php

    function callHotel($id_hotel = false)
    {
        if ($id_hotel === false) {
            return $this->db->table('tbl_hotel')->get();
        } else {
            return $this->Where(['id_hotel' => $id_hotel])->get();
---
SELECT *
FROM `tbl_hotel`
SELECT *
FROM `tbl_hotel`
WHERE `id_hotel` = '14'

    function addHotel($addHotel)
    {
        return $this->db->table('tbl_hotel')->insert($addHotel);
---
INSERT INTO `tbl_hotel` (`nama_hotel`, `alamat_hotel`, `coordinate`, `id_provinsi`, `id_kabupaten`, `id_kecamatan`, `id_kelurahan`, `id_jenjang`, `akreditasi`, `status`, `foto_hotel`) VALUES ('ghjf', 'hfghfgh', NULL, '14', '1404', '1404012', '1404012003', '1', 'A', 'swasta', '1668524047_07ab779cb84af1c0e5e9.png')

    public function allBintang()
    {
        return $this->db->table('tbl_status_bintang')->orderBy('id_bintang', 'ASC')->get()->getResultArray();
---
SELECT *
FROM `tbl_status_bintang`
ORDER BY `id_bintang` ASC

    public function allProvinsi()
    {
        return $this->db->table('tbl_provinsi')->orderBy('id_provinsi', 'ASC')->get()->getResultArray();
---
SELECT *
FROM `tbl_provinsi`
ORDER BY `id_provinsi` ASC

    public function allKabupaten($id_provinsi)
    {
        return $this->db->table('tbl_kabupaten')->where('id_provinsi', $id_provinsi)->get()->getResultArray();
---
SELECT *
FROM `tbl_kabupaten`
WHERE `id_provinsi` = '15'

    public function allKecamatan($id_kecamatan)
    {
        return $this->db->table('tbl_kecamatan')->where('id_kabupaten', $id_kecamatan)->get()->getResultArray();
---
SELECT *
FROM `tbl_kecamatan`
WHERE `id_kabupaten` = '1504'

    public function allKelurahan($id_kelurahan)
    {
        return $this->db->table('tbl_kelurahan')->where('id_kecamatan', $id_kelurahan)->get()->getResultArray();
---
SELECT *
FROM `tbl_kelurahan`
WHERE `id_kecamatan` = '1504011'